Autodesk.Revit.DB.Structure.StructuralSettings.GetStructuralSettings(Autodesk.Revit.DB.Document)
Obtains the StructuralSettings object for the specified project document.
doc:
A project document.
Returns:
The StructuralSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelVerticalAutofixTolerance
Tolerance for vertical auto-detect for the analytical model.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelHorizontalAutofixTolerance
Tolerance for horizontal auto-detect for the analytical model.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.CheckAnalyticalModelAsset
Whether to check for valid Asset within the Material of associated Physical Element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.DifferentiateAnalyticalEnds
Whether to use a subcategory for the ends of a linear analytical model, rather than
the main category.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelCheckAdjustment
Whether to check for analytical model distance from default location is
larger than the tolerance defined by the property
AnalyticalModelAdjustmentTolerance.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelCheckInstability
Whether to check for possible instability based on release conditions.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelCheckBeamSlabDistance
Whether to check the analytical model distance between beam and slab for a level.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelCheckSupportDistance
Check that joins in the physical model are consistent
with proximity in the analytical model.
Remarks:
When this check is enabled, a warning will be given
for physically joined members whose analytical curves are
more than a certain distance apart. The distance is given
by the AnalyticalModelSupportDistanceTolerance property.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelCheckDiscrepancy
Whether to check for distance between analytical and physical models
greater than a tolerance defined by
AnalyticalModelDiscrepancyTolerance.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelCheckCircularReferences
Whether to check member supports for circular references.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelAutoCheckConsistency
Whether to check automatically for consistency between the analytical
and physical models.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelAutoCheckMemberSupports
Whether to check automatically for member supports.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.ShowBraceBelow
Whether to show brace symbols below beams in plan views.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.ShowBraceAbove
Whether to show brace symbols above beams in plan views.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolUserDefined
The id of the FamilySymbol to represent a user-defined boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolRoller
The id of the FamilySymbol to represent a roller boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolPinned
The id of the FamilySymbol to represent a pinned boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionFamilySymbolFixed
The id of the FamilySymbol to represent a fixed boundary condition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.KickerBraceSymbol
The id of the ElementType to represent a kicker brace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceBelowSymbol
The id of the ElementType to represent a brace below a beam in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceAboveSymbol
The id of the ElementType to represent a brace above a beam in plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BoundaryConditionAreaAndLineSymbolSpacing
Symbol spacing for boundary conditions.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelDiscrepancyTolerance
Tolerance for the analytical-to-physical model distance.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalModelSupportDistanceTolerance
The maximum distance between two structural elements,
where analytical model support rules still apply.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForColumn
Symbolic cutback distance to be applied to all columns.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.AnalyticalLinkAutofixTolerance
Tolerance for the analytical link distance.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForBrace
Symbolic cutback distance to be applied to all braces.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.SymbolicCutbackForBeamAndTruss
Symbolic cutback distance to be applied to all beams and trusses.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings.BraceParallelLineOffset
The distance by which brace symbols in plan
views will be offset.
Remarks:
Applies only when BracePlanRepresentation is set to ParallelLine.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralSettings
Provides access to project-wide structural settings.
Since:
2011